CSI API ETABS v1

# cCaseResponseSpectrumGetDiaphragmEccentricityOverride Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetDiaphragmEccentricityOverride(
    	string Name,
    	ref int Num,
    	ref string[] Diaph,
    	ref double[] Eccen
    )

    Function GetDiaphragmEccentricityOverride (
    	Name As String,
    	ByRef Num As Integer,
    	ByRef Diaph As String(),
    	ByRef Eccen As Double()
    ) As Integer

    Dim instance As cCaseResponseSpectrum
    Dim Name As String
    Dim Num As Integer
    Dim Diaph As String()
    Dim Eccen As Double()
    Dim returnValue As Integer

    returnValue = instance.GetDiaphragmEccentricityOverride(Name,
    	Num, Diaph, Eccen)

    int GetDiaphragmEccentricityOverride(
    	String^ Name,
    	int% Num,
    	array<String^>^% Diaph,
    	array<double>^% Eccen
    )

    abstract GetDiaphragmEccentricityOverride :
            Name : string *
            Num : int byref *
            Diaph : string[] byref *
            Eccen : float[] byref -> int

#### Parameters

Name

    Type: SystemString

Num

    Type: SystemInt32

Diaph

    Type: SystemString

Eccen

    Type: SystemDouble

#### Return Value

Type: Int32

See Also

#### Reference

cCaseResponseSpectrum Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com